# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [ ]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [1]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [2]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [3]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [4]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [5]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [10]:
%%sql
select * from payment limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16055, 269, 2, 1099, Decimal('2.99'), datetime.datetime(2017, 1, 31, 12, 23, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16056, 270, 1, 193, Decimal('1.99'), datetime.datetime(2017, 1, 26, 5, 10, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16057, 270, 1, 1040, Decimal('4.99'), datetime.datetime(2017, 1, 31, 4, 3, 42, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16058, 271, 1, 1096, Decimal('8.99'), datetime.datetime(2017, 1, 31, 11, 59, 15, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16059, 272, 1, 33, Decimal('0.99'), datetime.datetime(2017, 1, 25, 2, 47, 17, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [11]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [12]:
%%sql
select * from dimDate limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(20170407, datetime.date(2017, 4, 7), 2017, 2, 4, 7, 14, False),
 (20170130, datetime.date(2017, 1, 30), 2017, 1, 1, 30, 5, False),
 (20170318, datetime.date(2017, 3, 18), 2017, 1, 3, 18, 11, True),
 (20170426, datetime.date(2017, 4, 26), 2017, 2, 4, 26, 17, False),
 (20170215, datetime.date(2017, 2, 15), 2017, 1, 2, 15, 7, False),
 (20170317, datetime.date(2017, 3, 17), 2017, 1, 3, 17, 11, False),
 (20170411, datetime.date(2017, 4, 11), 2017, 2, 4, 11, 15, False),
 (20170216, datetime.date(2017, 2, 16), 2017, 1, 2, 16, 7, False),
 (20170319, datetime.date(2017, 3, 19), 2017, 1, 3, 19, 11, True),
 (20170408, datetime.date(2017, 4, 8), 2017, 2, 4, 8, 14, True)]

In [13]:
%%sql
select * from customer limit 2;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1)]

In [15]:
%%sql
select * from address limit 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [17]:
%%sql
select * from city limit 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 'A Corua (La Corua)', 87, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [18]:
%%sql
select * from country limit 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 'Afghanistan', datetime.datetime(2017, 2, 15, 9, 44, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [20]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT
    c.customer_id as customer_key,
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    a.phone,
    c.active,
    c.create_date,
    now()         AS start_date,
    now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [21]:
%%sql
select * from film limit 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2017, 9, 10, 17, 46, 3, 905795, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17")]

In [22]:
%%sql
select * from language limit 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 'English             ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [25]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, 
                     rental_duration, length, rating, special_features)
SELECT
    f.film_id AS movie_key,
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name AS language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [28]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, 
                      manager_first_name, manager_last_name, start_date, end_date) 
SELECT
    s.store_id AS store_key,
    s.store_id,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    st.first_name AS manager_first_name,
    st.last_name AS manager_last_name,
    now() AS start_date,
    now() AS end_date
FROM store s 
JOIN address a ON (s.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
JOIN country co ON (co.country_id = ci.country_id)
JOIN staff st ON (s.manager_staff_id = st.staff_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [35]:
%%sql
INSERT INTO factSales (sales_key, date_key, customer_key, movie_key, store_key, sales_amount)
SELECT
    p.payment_id AS sales_key,
    TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
    p.customer_id AS customer_key,
    i.film_id AS movie_key,
    i.store_id AS store_key,
    p.amount AS sales_amount
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (i.inventory_id = r.inventory_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

In [37]:
%%sql
select * from factSales limit 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(16050, 20170124, 269, 870, 2, Decimal('1.99'))]